# Import Pandas Library

In [2]:
import pandas as pd
import numpy as np

# Data Structures

## First: Series

In [3]:
lst = [1,2,3,4,5] 
s = pd.Series(lst)
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [4]:
# change dtype
s = pd.Series(lst, dtype= float)
s

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
dtype: float64

In [5]:
# choose indexes
s = pd.Series(lst, index=['A', 'B', 'C', 'D', 'E' ])
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [6]:
index = [10, 12, 13, 14]
names = ['Nourah', 'Sarah', 'Ahmed', 'Lama']
s2 = pd.Series(names, index=index)
s2

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [7]:
# use dictionary 
names = {10: 'Nourah', 12: 'Sarah', 13: 'Ahmed', 14: 'Lama'}
s3 = pd.Series(names)
s3

10    Nourah
12     Sarah
13     Ahmed
14      Lama
dtype: object

In [8]:
# change the indexes
s3.index = [10, 20, 30, 40]
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [11]:
fruit1 = {'Apple': 40 , 'Banana': 50, 'Orange': 60}
ser1 = pd.Series(fruit1)

fruit2 = {'Apple': 30 , 'Strawberry': 20, 'Orange': 20}
ser2 = pd.Series(fruit2)

In [9]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
dtype: object

In [10]:
# Selecting
print(s3[20]) # index = 20

Sarah

In [11]:
# Slicing like numpy [start, end(execluded), gap]
# Note that the slice does not use the index labels as references, but the position
s3[:3] # from position 0 to 2

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [14]:
s3[:-1] # from 0 to last item(execluded)

10    Nourah
20     Sarah
30     Ahmed
dtype: object

In [15]:
# Add elements 
s4 = pd.Series({50: 'Ahmed', 60: 'Nada'})
s3 = s3.append(s4)
s3

/var/folders/b1/p4lqt35d7gl61cs05z1pf7l00000gn/T/ipykernel_9753/679673619.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3 = s3.append(s4)

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50     Ahmed
60      Nada
dtype: object

In [16]:
x = pd.Series(['a', 'b'])
y = pd.Series(['c', 'd'])
z = pd.concat([x, y])
z

0    a
1    b
0    c
1    d
dtype: object

In [17]:
z = pd.concat([x, y],ignore_index=True )
z

0    a
1    b
2    c
3    d
dtype: object

In [18]:
# delete an element 
s3.drop(60)

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50     Ahmed
dtype: object

In [19]:
s3

10    Nourah
20     Sarah
30     Ahmed
40      Lama
50     Ahmed
60      Nada
dtype: object

In [20]:
# drop duplicate elements
s3.drop_duplicates()

10    Nourah
20     Sarah
30     Ahmed
40      Lama
60      Nada
dtype: object

In [21]:
s

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [22]:
s4 = s.copy()
s4

A    1
B    2
C    3
D    4
E    5
dtype: int64

In [23]:
s4 = s4*3
s4

A     3
B     6
C     9
D    12
E    15
dtype: int64

In [24]:
s4.add(s)

A     4
B     8
C    12
D    16
E    20
dtype: int64

In [25]:
s5 = pd.Series({'A': 6, 'B': 8})
s5 = s5.add(s)

In [26]:
s5 # you have to save the result

A     7.0
B    10.0
C     NaN
D     NaN
E     NaN
dtype: float64

In [27]:
s4.sub(s)

A     2
B     4
C     6
D     8
E    10
dtype: int64

In [28]:
s4.mul(s)

A     3
B    12
C    27
D    48
E    75
dtype: int64

In [29]:
s4.div(s)

A    3.0
B    3.0
C    3.0
D    3.0
E    3.0
dtype: float64

## Second: DataFrame

### A- Creating a new DataFrame from the scratch

In [14]:
data = {'SalesPerson': ['Kathey', 'Michael', 'William', 'Kathey', 'William', 'Kathey', 'Michael'],
        'Region': ['East', 'West', 'North', 'South', 'North', 'North', 'East'],
        'OrderAmount': [600, 700, 400, 500, 400, 700, 800],
        'Month': ['Jan', 'Feb', 'Feb', 'Mar', 'May', 'Apr', 'May'],
        'isAccepted': [True, False, False, True, True, True, False]
       }

SalesDF = pd.DataFrame(data)
SalesDF

  SalesPerson Region  OrderAmount Month  isAccepted
0      Kathey   East          600   Jan        True
1     Michael   West          700   Feb       False
2     William  North          400   Feb       False
3      Kathey  South          500   Mar        True
4     William  North          400   May        True
5      Kathey  North          700   Apr        True
6     Michael   East          800   May       False

In [15]:
data = {'year': [2010, 2011, 2012, 2010, 2011, 2012, 2010, 2011, 2012],
        'team': ['FCBarcelona', 'FCBarcelona', 'FCBarcelona', 'RMadrid', 'RMadrid', 'RMadrid', 'ValenciaCF',
                 'ValenciaCF', 'ValenciaCF'],
        'wins':   [30, 28, 32, 29, 32, 26, 21, 17, 19],
        'draws':  [6, 7, 4, 5, 4, 7, 8, 10, 8],
        'losses': [2, 3, 2, 4, 2, 5, 9, 11, 11]}

football = pd.DataFrame(data)
football

   year         team  wins  draws  losses
0  2010  FCBarcelona    30      6       2
1  2011  FCBarcelona    28      7       3
2  2012  FCBarcelona    32      4       2
3  2010      RMadrid    29      5       4
4  2011      RMadrid    32      4       2
5  2012      RMadrid    26      7       5
6  2010   ValenciaCF    21      8       9
7  2011   ValenciaCF    17     10      11
8  2012   ValenciaCF    19      8      11

### B- Reading tabular data

In [16]:
edu = pd.read_csv('educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [35]:
edu.dtypes

TIME                   int64
GEO                   object
INDIC_ED              object
Value                 object
Flag and Footnotes    object
dtype: object

# Viewing Data

In [38]:
edu.head() #first rows that are listed

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [39]:
edu.head(3)

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)    5.0

In [ ]:
edu.shape

In [40]:
edu.tail() #last rows that are listed

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [41]:
edu.columns

Index(['TIME', 'GEO', 'Value'], dtype='object')

In [ ]:
edu.columns =

In [42]:
edu.columns[0]

'TIME'

In [43]:
edu.index

RangeIndex(start=0, stop=384, step=1)

In [44]:
edu.values # values of any DataFrame can be retrieved as a Python array by calling its values attribute.

array([[2000, 'European Union (28 countries)', nan],
       [2001, 'European Union (28 countries)', nan],
       [2002, 'European Union (28 countries)', 5.0],
       ...,
       [2009, 'Finland', 6.81],
       [2010, 'Finland', 6.85],
       [2011, 'Finland', 6.76]], dtype=object)

In [45]:
# quick statistical information
edu.describe()

              TIME       Value
count   384.000000  361.000000
mean   2005.500000    5.203989
std       3.456556    1.021694
min    2000.000000    2.880000
25%    2002.750000    4.620000
50%    2005.500000    5.060000
75%    2008.250000    5.660000
max    2011.000000    8.810000

In [46]:
edu.describe(include=[object])

                                  GEO
count                             384
unique                             32
top     European Union (28 countries)
freq                               12

In [47]:
edu.describe(exclude="number")

                                  GEO
count                             384
unique                             32
top     European Union (28 countries)
freq                               12

In [48]:
edu.T

,0,1,2,3,4,5,6,7,8,9,...,374,375,376,377,378,379,380,381,382,383
TIME,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,...,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011
GEO,European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),European Union (28 countries),...,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland,Finland
Value,NaN,NaN,5.0,5.03,4.95,4.92,4.91,4.92,5.04,5.38,...,6.22,6.43,6.42,6.3,6.18,5.9,6.1,6.81,6.85,6.76

# Selection

In [49]:
edu['Value'] # The result will be a Series data structure, not a DataFrame, because only one column is retrieved.

0       NaN
1       NaN
2      5.00
3      5.03
4      4.95
       ...
379    5.90
380    6.10
381    6.81
382    6.85
383    6.76
Name: Value, Length: 384, dtype: float64

In [50]:
edu[['Value','GEO']]

     Value                            GEO
0      NaN  European Union (28 countries)
1      NaN  European Union (28 countries)
2     5.00  European Union (28 countries)
3     5.03  European Union (28 countries)
4     4.95  European Union (28 countries)
..     ...                            ...
379   5.90                        Finland
380   6.10                        Finland
381   6.81                        Finland
382   6.85                        Finland
383   6.76                        Finland

[384 rows x 2 columns]

In [51]:
edu[10:14] # select a subset of rows from a DataFrame

    TIME                            GEO  Value
10  2010  European Union (28 countries)   5.41
11  2011  European Union (28 countries)   5.25
12  2000  European Union (27 countries)   4.91
13  2001  European Union (27 countries)   4.99

In [52]:
edu.loc[90:94, ['TIME', 'GEO']]  #[rows, columns]

    TIME      GEO
90  2006  Belgium
91  2007  Belgium
92  2008  Belgium
93  2009  Belgium
94  2010  Belgium

In [53]:
edu.loc[90:94,:] #[rows, columns=all]

    TIME      GEO  Value
90  2006  Belgium   5.98
91  2007  Belgium   6.00
92  2008  Belgium   6.43
93  2009  Belgium   6.57
94  2010  Belgium   6.58

In [54]:
edu.sample(10,random_state=23) # random sample >> 23 seed for random number generator.
# seed makes the random numbers predictable

     TIME                       GEO  Value
294  2006               Netherlands   5.50
343  2007                   Romania   4.25
178  2010                    Greece    NaN
73   2001  Euro area (13 countries)   4.97
284  2008                     Malta   5.72
193  2001                    France   5.95
236  2008                    Latvia   5.71
205  2001                     Italy   4.83
59   2011  Euro area (17 countries)   5.15
252  2000                Luxembourg    NaN

# Filtering Data

In [57]:
edu['Value'] > 6.5

0      False
1      False
2      False
3      False
4      False
       ...
379    False
380    False
381     True
382     True
383     True
Name: Value, Length: 384, dtype: bool

In [56]:
# Another way of selection
# by applying Boolean indexing. This indexing is commonly known as a filter. 
edu[edu['Value'] > 6.5]

     TIME      GEO  Value
286  2010    Malta   6.74
287  2011    Malta   7.96
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

# Filtering Missing and dupliacated Values

In [ ]:
edu['Value'].isnull()#.sum()

In [58]:
edu[edu['Value'].isnull()].head()

    TIME                            GEO  Value
0   2000  European Union (28 countries)    NaN
1   2001  European Union (28 countries)    NaN
36  2000       Euro area (18 countries)    NaN
37  2001       Euro area (18 countries)    NaN
48  2000       Euro area (17 countries)    NaN

In [21]:
edu[edu.duplicated('Value')]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
7,2007,European Union (28 countries),Total public expenditure on education as % of ...,4.92,e
12,2000,European Union (27 countries),Total public expenditure on education as % of ...,4.91,s
14,2002,European Union (27 countries),Total public expenditure on education as % of ...,5.00,e
15,2003,European Union (27 countries),Total public expenditure on education as % of ...,5.04,e
...,...,...,...,...,...
369,2009,Slovakia,Total public expenditure on education as % of ...,4.09,d
370,2010,Slovakia,Total public expenditure on education as % of ...,4.22,d
375,2003,Finland,Total public expenditure on education as % of ...,6.43,NaN
378,2006,Finland,Total public expenditure on education as % of ...,6.18,NaN
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN

In [ ]:
edu.drop_duplicates('Value')

# Manipulating Data

In [17]:
edu.head()

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [62]:
edu['Value'].head()

0     NaN
1     NaN
2    5.00
3    5.03
4    4.95
Name: Value, dtype: float64

In [63]:
edu['Value'] / 100 # you can apply it by one step

0       NaN
1       NaN
2    0.0500
3    0.0503
4    0.0495
Name: Value, dtype: float64

In [65]:
# we can apply any function to a DataFrame or Series
edu['Value'].apply(np.sqrt) # sqrt function from the numpy library

0         NaN
1         NaN
2    2.236068
3    2.242766
4    2.224860
Name: Value, dtype: float64

In [ ]:
edu['Value'].map(np.sqrt)

In [66]:
def f2(x):
    return x**2
edu['Value'].apply(f2)

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [68]:
edu['Value'].apply(lambda d: d**2)

0        NaN
1        NaN
2    25.0000
3    25.3009
4    24.5025
Name: Value, dtype: float64

In [ ]:
# add a new column to a DataFrame
edu['ValueNorm'] =

In [ ]:
edu[['Value','TIME']].apply(lambda)

In [69]:
# add a new column to a DataFrame
edu['ValueNorm'] = edu['Value'] / edu['Value'].max()
edu.tail()

     TIME      GEO  Value  ValueNorm
379  2007  Finland   5.90   0.669694
380  2008  Finland   6.10   0.692395
381  2009  Finland   6.81   0.772985
382  2010  Finland   6.85   0.777526
383  2011  Finland   6.76   0.767310

In [70]:
edu

     TIME                            GEO  Value  ValueNorm
0    2000  European Union (28 countries)    NaN        NaN
1    2001  European Union (28 countries)    NaN        NaN
2    2002  European Union (28 countries)   5.00   0.567537
3    2003  European Union (28 countries)   5.03   0.570942
4    2004  European Union (28 countries)   4.95   0.561862
..    ...                            ...    ...        ...
379  2007                        Finland   5.90   0.669694
380  2008                        Finland   6.10   0.692395
381  2009                        Finland   6.81   0.772985
382  2010                        Finland   6.85   0.777526
383  2011                        Finland   6.76   0.767310

[384 rows x 4 columns]

In [71]:
# remove this column from the DataFrame
# rows(axis=0), columns(axis=1) 
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop('ValueNorm', axis=1, inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

In [72]:
edu

     TIME                            GEO  Value
0    2000  European Union (28 countries)    NaN
1    2001  European Union (28 countries)    NaN
2    2002  European Union (28 countries)   5.00
3    2003  European Union (28 countries)   5.03
4    2004  European Union (28 countries)   4.95
..    ...                            ...    ...
379  2007                        Finland   5.90
380  2008                        Finland   6.10
381  2009                        Finland   6.81
382  2010                        Finland   6.85
383  2011                        Finland   6.76

[384 rows x 3 columns]

In [73]:
# insert a new row
# ignore_index=True, otherwise the index 0
edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)
edu.tail()

/var/folders/b1/p4lqt35d7gl61cs05z1pf7l00000gn/T/ipykernel_9753/1131353661.py:3: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  edu = edu.append({'TIME': 2000, 'Value': 5.00, 'GEO': 'a'}, ignore_index=True)

     TIME      GEO  Value
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76
384  2000        a   5.00

In [74]:
# remove row(axis=0)
# inplace = False (default), inplace=True (change original DataFrame)
edu.drop(max(edu.index), axis=0, inplace=True)
edu.tail()

     TIME      GEO  Value
379  2007  Finland   5.90
380  2008  Finland   6.10
381  2009  Finland   6.81
382  2010  Finland   6.85
383  2011  Finland   6.76

In [75]:
# to clear data frame
edu.drop(edu.index, inplace=False)

Empty DataFrame
Columns: [TIME, GEO, Value]
Index: []

# Sorting

In [82]:
edu.sort_values(by='Value', ascending=False, inplace=True)
edu.head()

     TIME      GEO  Value
130  2010  Denmark   8.81
131  2011  Denmark   8.75
129  2009  Denmark   8.74
121  2001  Denmark   8.44
122  2002  Denmark   8.44

In [83]:
# to return to the original order, we can sort by an index using the sort_index and axis=0
edu.sort_index(axis=0, ascending=True, inplace=True)
edu.head()

   TIME                            GEO  Value
0  2000  European Union (28 countries)    NaN
1  2001  European Union (28 countries)    NaN
2  2002  European Union (28 countries)   5.00
3  2003  European Union (28 countries)   5.03
4  2004  European Union (28 countries)   4.95

# Grouping Data

In [ ]:
# By “group by” we are referring to a process involving one or more of the following steps:
# 1. Splitting the data into groups based on some criteria
# 2. Applying a function to each group independently
# 3. Combining the results into a data structure

In [ ]:
edu.groupby('GEO').mean()

In [84]:
# like group by in sql
group = edu[['GEO', 'Value']].groupby('GEO').mean()
group.head()

                   Value
GEO
Austria         5.618333
Belgium         6.189091
Bulgaria        4.093333
Cyprus          7.023333
Czech Republic  4.168333

# Merging Data

In [ ]:
df = pd.DataFrame(np.random.randn(10, 4))

In [ ]:
df[:3]

In [ ]:
df[3:7]

In [ ]:
df[7:]

In [ ]:
pd.concat()

In [ ]:
pd.merge(left, right, on="key")

# Resources
- Chapter 2, Introduction to Data Science by Laura Igual and Santi Seguí
    - https://github.com/DataScienceUB/introduction-datascience-python-book 
- pandas Documentation: https://pandas.pydata.org/